import '../../css/legal.css';


export default function TermsOfService() {
  return (
    <section className="legal__section">
      <div className="container">
        <div className="legal__content">
          <div className="legal__header">
            <h1 className="legal__title">Пользовательское соглашение</h1>
          </div>

          <div className="legal__body">
            <div className="legal__article">
              <h2 className="legal__subtitle">1. Общие положения</h2>
              <p>
                <strong>1.1</strong> Пользовательское соглашение (далее — Соглашение) является публичной офертой и определяет условия использования материалов и сервисов, размещенных Администратором на сайте в сети Интернет по адресу: <a href="https://desewre.ru">https://desewre.ru</a> (далее — «Сайт») пользователями при помощи Сервиса.
              </p>
              <p>
                <strong>1.2.</strong> Сервис — это программно-аппаратный комплекс, доступный на Сайте, позволяющий Пользователю использовать предусмотренный для него функционал. Сервис включает в себя интерфейс, программное обеспечение и иные элементы (инструменты, алгоритмы, способы), необходимые для надлежащего функционирования Сайта.
              </p>
              <p>
                <strong>1.3.</strong> Администратором является компания DESEWRE (далее — Администратор).
              </p>
              <p>
                <strong>1.4.</strong> Пользователь — любое физическое лицо и/или юридическое лицо, в том числе посетитель Сайта, принимающий условия Соглашения.
              </p>
              <p>
                <strong>1.5.</strong> Начиная использовать Сайт и/или его отдельные функции, Пользователь считается принявшим условия Соглашения в полном объеме, без всяких оговорок и исключений.
              </p>
              <p>
                <strong>1.6.</strong> В случае несогласия с Соглашением Пользователь обязан немедленно прекратить использование Сайта и покинуть его.
              </p>
            </div>

            <div className="legal__article">
              <h2 className="legal__subtitle">2. Обязательства пользователя</h2>
              <p>
                <strong>2.1.</strong> Любое использование материалов Сайта, включая, но не ограничиваясь, копирование, воспроизведение, переработка материалов, использованных на Сайте, не допускается, за исключением цитирования материалов в объеме объективно необходимом для целей цитирования Пользователем материалов.
              </p>
              <p>
                <strong>2.2.</strong> При цитировании материалов Сайта, включая охраняемые авторские произведения, ссылка на Сайт обязательна.
              </p>
            </div>

            <div className="legal__article">
              <h2 className="legal__subtitle">3. Ответственность администратора</h2>
              <p>
                <strong>3.1.</strong> Администратор не несет ответственности за посещение и использование Пользователем внешних ресурсов, ссылки на которые могут содержаться на Сайте.
              </p>
              <p>
                <strong>3.2.</strong> Администратор не несет ответственности и не имеет прямых или косвенных обязательств перед Пользователем в связи с любыми возможными или возникшими потерями или убытками, связанными с любым содержанием Сайта, регистрацией авторских прав и сведениями о такой регистрации, товарами или услугами, доступными на или полученными через внешние сайты или ресурсы либо иные контакты Пользователя, в которые он вступил, используя размещенную на Сайте информацию или ссылки на внешние ресурсы.
              </p>
            </div>

            <div className="legal__article">
              <h2 className="legal__subtitle">4. Изменение условий соглашения</h2>
              <p>
                <strong>4.1.</strong> Администратор вправе в любое время в одностороннем порядке изменять условия Соглашения. Такие изменения вступают в силу по истечении 10 дней с момента размещения новой версии Соглашения на Сайте.
              </p>
              <p>
                <strong>4.2.</strong> При несогласии Пользователя с внесенными изменениями он обязан отказаться от доступа к Сайту. Прекратить использование материалов и сервисов Сайта.
              </p>
              <p>
                <strong>4.3.</strong> Продолжая использовать Сайт, Пользователь подтверждает свое безоговорочное согласие с новой версией Соглашения.
              </p>
            </div>

            <div className="legal__article">
              <h2 className="legal__subtitle">5. Заключительные положения</h2>
              <p>
                <strong>5.1.</strong> Все возможные споры, вытекающие из Соглашения или связанные с ним, подлежат разрешению в соответствии с действующим законодательством Российской Федерации.
              </p>
            </div>
          </div>
        </div>
      </div>
    </section>
  );
}
